export const surveyExplain = [
    { 
        load : false,
        style : 'font-size : 40px; font-weight: 700;'
    },
    { 
        load : false ,
        style : 'font-size : 40px; font-weight: 700;'
    },
    { 
        load : false ,
        style : 'font-size : 20px; font-weight: 500; margin-top: 50px;'
    },
    { 
        load : false ,
        style : 'font-size : 20px; font-weight: 500;'
    },
]

export const optionalData = [
    { 
        title : '좋아하는 식당/카페 유형을 골라주세요', 
        types : ['한식', '양식', '카페/디저트', '일식', '술집', '중식', '아시아/퓨전', '고기', '해물/생선', '돈까스', '초밥/롤', '와인', '브런치', '베이커리', '비건'],
        selected : -1
    },
    { 
        title : '좋아하는 식당/카페의 특징을 골라주세요', 
        types : ['디저트맛집', '음료맛집', '커피맛집', '가성비', '시그니처', '조용함', '멋진인테리어', '뷰맛집', '사진맛집', '단체모임', '혼밥', '넓은매장', '청결', '많은양', '신선한재료', '편한좌석', '편한주차', '친절맛집', '기념일', '꿀맛집', '멋진외관', '좋은식감', '분위기맛집', '소문난집', '고급'],
        selected : -1
    },
    { 
        title : '좋아하는 관광지 유형을 골라주세요', 
        types : ['피크닉/공원', '문화예술', '자연명소', '역사유적', '체험관광', '테마파크', '물놀이', '캠핑', '레저/액티비티', '등산/트레킹', '낚시', '클래스/소품', '숙박', '겨울레포츠', '바다/해변'],
        selected : -1
    },
    { 
        title : '좋아하는 관광지의 특징을 골라주세요', 
        types : ['인테리어가 멋져요', '뷰가 좋아요', '사진이 잘 나와요', '주차하기 편해요', '특별한 날 가기 좋아요', '외관이 멋져요', '분위기가 좋아요', '유명한 명소에요', '야경이 멋져요', '힐링 돼요', '산책할 수 있어요', '시장이 있어요'],
        selected : -1
    },
]

export const YNData = [
    {
        title : '여행지에 도착한 당신. 어디부터?',
        types : ['한국인은 밥심이지! 부산 맛집에 간다', '부산은 바다지! 관광을 먼저 한다']
    },
    {
        title : '여행다니는 유형은?',
        types : ['풍부한 경험! 아침부터 부지런히~', '여행은 휴식~ 여유롭게 준비하고 움직인다']
    },
    {
        title : '여행하면서 남는 것은?',
        types : ['남는 건 사진이야! 사진 건졌으면 끝', '남는 건 경험이야! 관광정보를 숙지하고 구경하고 봐야한다']
    },
    {
        title : '여행을 가는 당신의 목적은?',
        types : ['여행은 힐링. 지친 일상에서 도망친 것', '여행은 관광. 여러가지를 보고 즐기기 위해 온 것']
    },
    {
        title : '돈을 사용하는 법은?',
        types : ['이왕 놀러온거니까 아끼지 않고 flex!', '현생이 기다리고 있으니 적당히 써야지..']
    },
    {
        title : '식당을 고르는 방법은?',
        types : ['무조건 삼시세끼 맛집! SNS의 모든 맛집을 검색해서 알아둔다', '일정에 맞춰서 적당히 가자~ 때에 맞춰 아무 곳이나 들어간다']
    },
    {
        title : '관광지를 선택하는 방법은?',
        types : ['리뷰를 읽어보고 간다. 저기는 유명하지만 별로라는 평이 많대', '리뷰에 신경쓰지 않고 가본다. 나는 좋을 수도 있지 않을까?']
    },
    {
        title : '해가 지고 어디부터 가지?',
        types : ['야경과 함께 사진!', '야시장 먹거리 탐색', '숙소에 가서 바로 휴식!']
    }
]

export const resultData = [
    {},
    {
        title : 'C. 포토파',
        content : '여행 후 남는 건 사진이지~ 부산의 특별한 장소에서 추억을 남기려는 당신에게 여행이 끝나면 사진첩에 부산 추억이 가득하도록 포토스팟을 지금부터 보여드릴게요!'
    },
    {
        title : 'B. 먹방파',
        content : '여행은 역시 맛집과 함께! 부산만의 다양한 음식과 맛집을 찾는 당신에게 익숙하면서도 색다른 꿀맛집을 모아 지금부터 추천해드릴게요!'
    },
    {
        title : 'D. 관광파',
        content : '내 머리 속엔 여행, 경관, 아름다움, 성공적. 부산의 자연, 도심, 역사 등 더 멋진 곳을 찾는 당신에게 다양한 곳을 보고 들을 수 있도록 특별한 관광지를 지금부터 소개해드릴게요!'
    },
    {
        title : 'A. 힐링파',
        content : '지친 일상을 피해 여행을 떠나자! 여행 = 휴식이라고 생각하는 당신에게 부산에서 지친 일상을 내려두고 쉬어갈 수 있는 힐링 여행지를 지금부터 소개해드릴게요!'
    }
]